Диплом/src/DataProcessors/ЭкспортПоступленийВJSON/ЭкспортПоступленийВJSON.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЭкспортПоступленийВJSON</name>
</mdclass:DataProcessor>

Диплом/src/Documents/ПоступлениеМатериалов/ПоступлениеМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМатериалов</name>
  <registerRecords>AccumulationRegister.РегистрВзаиморасчетов</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоступления</name>
    <type>
      <types>DocumentRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/DataProcessors/ЭкспортПоступленийВJSON/Forms/Форма/Module.bsl
Процедура ВыгрузитьДокументыВJSON(Путь)
	
	ДатаНачала = НачалоДня(ПериодВыгрузки.ДатаНачала);
	ДатаОкончания = КонецДня(ПериодВыгрузки.ДатаОкончания);
	
	ИмяФайла = Путь; 
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.Организация КАК Организация,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.ДоговорПоступления КАК ДоговорПоступления,
	|	Документ.Помещение КАК Помещение,
	|	Документ.Сумма КАК СуммаДокумента,
	|	ТЧ.Ссылка КАК Ссылка1,
	|	ТЧ.НомерСтроки,
	|	ТЧ.Номенклатура,
	|	ТЧ.КоличествоМат,
	|	ТЧ.ЕдиницаИзмерения,
	|	ТЧ.Цена,
	|	ТЧ.Сумма
	|ИЗ
	|	Документ.ПоступлениеМатериалов КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеМатериалов.Материалы КАК ТЧ
	|		ПО Документ.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Ссылка,
	|	ТЧ.НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// 3. НАСТРОЙКА JSONWriter
	НастройкиЗаписи = Новый Структура;
	НастройкиЗаписи.Вставить("ИспользоватьСимволыЭкранирования", Истина);
	НастройкиЗаписи.Вставить("Отступ", 2); // Красивый отступ для читаемости
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(); // Сначала пишем в строку, потом в файл
	ЗаписьJSON.ЗаписатьНачалоМассива(); // Начинаем общий массив документов
	
	// Переменные для отслеживания смены документа в цикле
	ПредыдущийДокумент = Неопределено;
	ОткрытОбъектДокумента = Ложь;
	
	// 4. ЦИКЛ ОБРАБОТКИ ДАННЫХ
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущийДокумент = ВыборкаДетальныеЗаписи.Ссылка;
		
		// Если документ сменился (или это первая итерация)
	 Если ТекущийДокумент <> ПредыдущийДокумент Тогда
			
			// Если предыдущий документ был, нужно закрыть его табличную часть и сам объект
			Если ПредыдущийДокумент <> Неопределено Тогда
				ЗаписьJSON.ЗаписатьКонецМассива(); // Конец табличной части
				ЗаписьJSON.ЗаписатьКонецОбъекта(); // Конец объекта документа
			КонецЕсли;
			
			// Начинаем новый объект документа
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			// Пишем реквизиты шапки (6 штук)
			ЗаписьJSON.ЗаписатьИмяСвойства("Ссылка"); 
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Ссылка));
			ЗаписьJSON.ЗаписатьИмяСвойства("Дата");   
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Дата));
			ЗаписьJSON.ЗаписатьИмяСвойства("Номер");  
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Номер);
			
			ЗаписьJSON.ЗаписатьИмяСвойства("Организация"); 
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Организация));
			ЗаписьJSON.ЗаписатьИмяСвойства("Контрагент");
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Контрагент));
			ЗаписьJSON.ЗаписатьИмяСвойства("ДоговорПоступления"); 
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.ДоговорПоступления));
			ЗаписьJSON.ЗаписатьИмяСвойства("Помещение");
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Помещение));
			ЗаписьJSON.ЗаписатьИмяСвойства("СуммаДокумента");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.СуммаДокумента);
			
			// Открываем массив для табличной части
			ЗаписьJSON.ЗаписатьИмяСвойства("Материалы");
			ЗаписьJSON.ЗаписатьНачалоМассива();
			
			ОткрытОбъектДокумента = Истина;
			ПредыдущийДокумент = ТекущийДокумент;
		КонецЕсли;
		
		// Пишем строку табличной части (даже если она пустая из-за LEFT JOIN, проверяем ключевое поле ТЧ)
		// Предполагаем, что у ТЧ есть уникальный реквизит, например "Номенклатура" или просто НомерСтроки
		Если ВыборкаДетальныеЗаписи.НомерСтроки <> Неопределено Тогда 
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			
			ЗаписьJSON.ЗаписатьИмяСвойства("НомерСтроки"); ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.НомерСтроки);
			ЗаписьJSON.ЗаписатьИмяСвойства("Номенклатура"); ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Номенклатура));
			ЗаписьJSON.ЗаписатьИмяСвойства("КоличествоМат"); ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.КоличествоМат);
			ЗаписьJSON.ЗаписатьИмяСвойства("ЕдиницаИзмерения"); ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.ЕдиницаИзмерения));
			ЗаписьJSON.ЗаписатьИмяСвойства("Цена"); ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Цена);
			ЗаписьJSON.ЗаписатьИмяСвойства("Сумма"); ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Сумма);
			
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли;
		
	КонецЦикла;
	
	// 5. ЗАВЕРШЕНИЕ
	// Если цикл закончился, а последний документ не закрыт
	Если ОткрытОбъектДокумента Тогда
		ЗаписьJSON.ЗаписатьКонецМассива(); // Конец табличной части последнего документа
		ЗаписьJSON.ЗаписатьКонецОбъекта(); // Конец последнего документа
	КонецЕсли;
	
	ЗаписьJSON.ЗаписатьКонецМассива(); // Конец общего массива
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	ЗаписьВФайл = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	ЗаписьВФайл.ЗаписатьСтроку(СтрокаJSON);
	ЗаписьВФайл.Закрыть();
	
	Сообщить("Файл успешно создан: " + ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьСохраненияФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВыборФайла("json");
КонецПроцедуры      

&НаКлиенте
Процедура ВыборФайла(Фильтр="json")
		
	ДиалогВыбора = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	ДиалогВыбора.Заголовок = "Выберите файл";

	ДиалогВыбора.Фильтр = "Файл данных (*." + Фильтр + ")|*." + Фильтр + "";

	ДиалогВыбора.МножественныйВыбор=Ложь;

	Если ДиалогВыбора.Выбрать() Тогда

		ПутьСохраненияФайла = ДиалогВыбора.ПолноеИмяФайла;

	КонецЕсли;
КонецПроцедуры // ВыборФайла()


&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	ВыгрузитьДокументыВJSON(ПутьСохраненияФайла);
КонецПроцедуры


&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры
